backend/controllers/PostController.php

SELECT * FROM `post`
---
    public function actionMyIndex()
    {
        $post = Post::find()->all();

SELECT * FROM `post` WHERE `post_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {