frontend/controllers/PostController.php

SELECT * FROM `post`
---
    public function actionMyIndex()
    {
        $post = Post::find()->all();

SELECT EXISTS(SELECT * FROM `user` WHERE (`id`=2))
UPDATE `post` SET `post_update_timestamp`=1500552486, `post_image`='IMG_30912.jpg' WHERE `post_id`=2
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->post_uploader == Yii::$app->user->identity->id) {

// die("fuck yeh kya");

            $model->post_uploader = Yii::$app->user->identity->id;
            $model->post_timestamp = $model->post_timestamp;
            $model->post_update_timestamp = time();



            $image = UploadedFile::getInstance($model, 'post_image');

            if(empty($image)) {
                $model->save();
                return $this->redirect(['my-view', 'id' => $model->post_id]);
            }


            $model->post_image = $image->baseName.'.'.$image->extension;

            if($model->save()) {

                $image->saveAs('uploads/'.$model->post_image);

SELECT * FROM `post` WHERE `post_id`='2'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {